{"class_name": "Model", "keras_version": "2.2.4", "backend": "tensorflow", "config": {"name": "model_1", "layers": [{"name": "data", "class_name": "InputLayer", "config": {"name": "data", "dtype": "float", "sparse": false, "batch_input_shape": [null, null, 2]}, "inbound_nodes": []}, {"name": "block1_conv1", "class_name": "Conv1D", "config": {"trainable": true, "padding": "same", "dilation_rate": [1], "bias_regularizer": null, "data_format": "channels_last", "activity_regularizer": null, "activation": "relu", "kernel_regularizer": null, "name": "block1_conv1", "strides": [1], "kernel_size": [7], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_constraint": null, "filters": 32, "kernel_constraint": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["data", 0, 0, {}]]]}, {"name": "batch_normalization_1", "class_name": "BatchNormalization", "config": {"momentum": 0.95, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "scale": true, "axis": -1, "gamma_constraint": null, "name": "batch_normalization_1", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "gamma_regularizer": null, "trainable": true, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}}, "inbound_nodes": [[["block1_conv1", 0, 0, {}]]]}, {"name": "dropout_1", "class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "noise_shape": null, "seed": null, "rate": 0.5}, "inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]]}, {"name": "block1_conv2", "class_name": "Conv1D", "config": {"trainable": true, "padding": "same", "dilation_rate": [1], "bias_regularizer": null, "data_format": "channels_last", "activity_regularizer": null, "activation": "relu", "kernel_regularizer": null, "name": "block1_conv2", "strides": [1], "kernel_size": [7], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_constraint": null, "filters": 32, "kernel_constraint": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["dropout_1", 0, 0, {}]]]}, {"name": "batch_normalization_2", "class_name": "BatchNormalization", "config": {"momentum": 0.95, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "scale": true, "axis": -1, "gamma_constraint": null, "name": "batch_normalization_2", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "gamma_regularizer": null, "trainable": true, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}}, "inbound_nodes": [[["block1_conv2", 0, 0, {}]]]}, {"name": "pool1", "class_name": "MaxPooling1D", "config": {"name": "pool1", "strides": [2], "pool_size": [3], "padding": "same", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]]}, {"name": "block2_conv1", "class_name": "Conv1D", "config": {"trainable": true, "padding": "same", "dilation_rate": [1], "bias_regularizer": null, "data_format": "channels_last", "activity_regularizer": null, "activation": "relu", "kernel_regularizer": null, "name": "block2_conv1", "strides": [1], "kernel_size": [7], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_constraint": null, "filters": 32, "kernel_constraint": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["pool1", 0, 0, {}]]]}, {"name": "batch_normalization_3", "class_name": "BatchNormalization", "config": {"momentum": 0.95, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "scale": true, "axis": -1, "gamma_constraint": null, "name": "batch_normalization_3", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "gamma_regularizer": null, "trainable": true, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}}, "inbound_nodes": [[["block2_conv1", 0, 0, {}]]]}, {"name": "dropout_2", "class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "noise_shape": null, "seed": null, "rate": 0.5}, "inbound_nodes": [[["batch_normalization_3", 0, 0, {}]]]}, {"name": "block2_conv2", "class_name": "Conv1D", "config": {"trainable": true, "padding": "same", "dilation_rate": [1], "bias_regularizer": null, "data_format": "channels_last", "activity_regularizer": null, "activation": "relu", "kernel_regularizer": null, "name": "block2_conv2", "strides": [1], "kernel_size": [7], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_constraint": null, "filters": 32, "kernel_constraint": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["dropout_2", 0, 0, {}]]]}, {"name": "batch_normalization_4", "class_name": "BatchNormalization", "config": {"momentum": 0.95, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "scale": true, "axis": -1, "gamma_constraint": null, "name": "batch_normalization_4", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "gamma_regularizer": null, "trainable": true, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}}, "inbound_nodes": [[["block2_conv2", 0, 0, {}]]]}, {"name": "pool2", "class_name": "MaxPooling1D", "config": {"name": "pool2", "strides": [2], "pool_size": [3], "padding": "same", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["batch_normalization_4", 0, 0, {}]]]}, {"name": "block3_conv1", "class_name": "Conv1D", "config": {"trainable": true, "padding": "same", "dilation_rate": [1], "bias_regularizer": null, "data_format": "channels_last", "activity_regularizer": null, "activation": "relu", "kernel_regularizer": null, "name": "block3_conv1", "strides": [1], "kernel_size": [7], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_constraint": null, "filters": 64, "kernel_constraint": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["pool2", 0, 0, {}]]]}, {"name": "batch_normalization_5", "class_name": "BatchNormalization", "config": {"momentum": 0.95, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "scale": true, "axis": -1, "gamma_constraint": null, "name": "batch_normalization_5", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "gamma_regularizer": null, "trainable": true, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}}, "inbound_nodes": [[["block3_conv1", 0, 0, {}]]]}, {"name": "dropout_3", "class_name": "Dropout", "config": {"name": "dropout_3", "trainable": true, "noise_shape": null, "seed": null, "rate": 0.5}, "inbound_nodes": [[["batch_normalization_5", 0, 0, {}]]]}, {"name": "block3_conv2", "class_name": "Conv1D", "config": {"trainable": true, "padding": "same", "dilation_rate": [1], "bias_regularizer": null, "data_format": "channels_last", "activity_regularizer": null, "activation": "relu", "kernel_regularizer": null, "name": "block3_conv2", "strides": [1], "kernel_size": [7], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_constraint": null, "filters": 64, "kernel_constraint": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["dropout_3", 0, 0, {}]]]}, {"name": "batch_normalization_6", "class_name": "BatchNormalization", "config": {"momentum": 0.95, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "scale": true, "axis": -1, "gamma_constraint": null, "name": "batch_normalization_6", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "gamma_regularizer": null, "trainable": true, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}}, "inbound_nodes": [[["block3_conv2", 0, 0, {}]]]}, {"name": "pool3", "class_name": "MaxPooling1D", "config": {"name": "pool3", "strides": [2], "pool_size": [3], "padding": "same", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["batch_normalization_6", 0, 0, {}]]]}, {"name": "block4_conv1", "class_name": "Conv1D", "config": {"trainable": true, "padding": "same", "dilation_rate": [1], "bias_regularizer": null, "data_format": "channels_last", "activity_regularizer": null, "activation": "relu", "kernel_regularizer": null, "name": "block4_conv1", "strides": [1], "kernel_size": [7], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_constraint": null, "filters": 64, "kernel_constraint": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["pool3", 0, 0, {}]]]}, {"name": "batch_normalization_7", "class_name": "BatchNormalization", "config": {"momentum": 0.95, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "scale": true, "axis": -1, "gamma_constraint": null, "name": "batch_normalization_7", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "gamma_regularizer": null, "trainable": true, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}}, "inbound_nodes": [[["block4_conv1", 0, 0, {}]]]}, {"name": "dropout_4", "class_name": "Dropout", "config": {"name": "dropout_4", "trainable": true, "noise_shape": null, "seed": null, "rate": 0.5}, "inbound_nodes": [[["batch_normalization_7", 0, 0, {}]]]}, {"name": "block4_conv2", "class_name": "Conv1D", "config": {"trainable": true, "padding": "same", "dilation_rate": [1], "bias_regularizer": null, "data_format": "channels_last", "activity_regularizer": null, "activation": "relu", "kernel_regularizer": null, "name": "block4_conv2", "strides": [1], "kernel_size": [7], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_constraint": null, "filters": 64, "kernel_constraint": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["dropout_4", 0, 0, {}]]]}, {"name": "batch_normalization_8", "class_name": "BatchNormalization", "config": {"momentum": 0.95, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "scale": true, "axis": -1, "gamma_constraint": null, "name": "batch_normalization_8", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "gamma_regularizer": null, "trainable": true, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}}, "inbound_nodes": [[["block4_conv2", 0, 0, {}]]]}, {"name": "pool4", "class_name": "MaxPooling1D", "config": {"name": "pool4", "strides": [2], "pool_size": [3], "padding": "same", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["batch_normalization_8", 0, 0, {}]]]}, {"name": "block5_conv1", "class_name": "Conv1D", "config": {"trainable": true, "padding": "same", "dilation_rate": [1], "bias_regularizer": null, "data_format": "channels_last", "activity_regularizer": null, "activation": "relu", "kernel_regularizer": null, "name": "block5_conv1", "strides": [1], "kernel_size": [7], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_constraint": null, "filters": 128, "kernel_constraint": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["pool4", 0, 0, {}]]]}, {"name": "batch_normalization_9", "class_name": "BatchNormalization", "config": {"momentum": 0.95, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "scale": true, "axis": -1, "gamma_constraint": null, "name": "batch_normalization_9", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "gamma_regularizer": null, "trainable": true, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}}, "inbound_nodes": [[["block5_conv1", 0, 0, {}]]]}, {"name": "dropout_5", "class_name": "Dropout", "config": {"name": "dropout_5", "trainable": true, "noise_shape": null, "seed": null, "rate": 0.5}, "inbound_nodes": [[["batch_normalization_9", 0, 0, {}]]]}, {"name": "block5_conv2", "class_name": "Conv1D", "config": {"trainable": true, "padding": "same", "dilation_rate": [1], "bias_regularizer": null, "data_format": "channels_last", "activity_regularizer": null, "activation": "relu", "kernel_regularizer": null, "name": "block5_conv2", "strides": [1], "kernel_size": [7], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_constraint": null, "filters": 128, "kernel_constraint": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["dropout_5", 0, 0, {}]]]}, {"name": "batch_normalization_10", "class_name": "BatchNormalization", "config": {"momentum": 0.95, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "scale": true, "axis": -1, "gamma_constraint": null, "name": "batch_normalization_10", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "gamma_regularizer": null, "trainable": true, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}}, "inbound_nodes": [[["block5_conv2", 0, 0, {}]]]}, {"name": "pool5", "class_name": "MaxPooling1D", "config": {"name": "pool5", "strides": [2], "pool_size": [3], "padding": "same", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["batch_normalization_10", 0, 0, {}]]]}, {"name": "block6_conv1", "class_name": "Conv1D", "config": {"trainable": true, "padding": "same", "dilation_rate": [1], "bias_regularizer": null, "data_format": "channels_last", "activity_regularizer": null, "activation": "relu", "kernel_regularizer": null, "name": "block6_conv1", "strides": [1], "kernel_size": [7], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_constraint": null, "filters": 128, "kernel_constraint": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["pool5", 0, 0, {}]]]}, {"name": "batch_normalization_11", "class_name": "BatchNormalization", "config": {"momentum": 0.95, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "scale": true, "axis": -1, "gamma_constraint": null, "name": "batch_normalization_11", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "gamma_regularizer": null, "trainable": true, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}}, "inbound_nodes": [[["block6_conv1", 0, 0, {}]]]}, {"name": "dropout_6", "class_name": "Dropout", "config": {"name": "dropout_6", "trainable": true, "noise_shape": null, "seed": null, "rate": 0.5}, "inbound_nodes": [[["batch_normalization_11", 0, 0, {}]]]}, {"name": "block6_conv2", "class_name": "Conv1D", "config": {"trainable": true, "padding": "same", "dilation_rate": [1], "bias_regularizer": null, "data_format": "channels_last", "activity_regularizer": null, "activation": "relu", "kernel_regularizer": null, "name": "block6_conv2", "strides": [1], "kernel_size": [7], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_constraint": null, "filters": 128, "kernel_constraint": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["dropout_6", 0, 0, {}]]]}, {"name": "batch_normalization_12", "class_name": "BatchNormalization", "config": {"momentum": 0.95, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "scale": true, "axis": -1, "gamma_constraint": null, "name": "batch_normalization_12", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "gamma_regularizer": null, "trainable": true, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}}, "inbound_nodes": [[["block6_conv2", 0, 0, {}]]]}, {"name": "pool6", "class_name": "MaxPooling1D", "config": {"name": "pool6", "strides": [2], "pool_size": [3], "padding": "same", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["batch_normalization_12", 0, 0, {}]]]}, {"name": "block7_conv1", "class_name": "Conv1D", "config": {"trainable": true, "padding": "same", "dilation_rate": [1], "bias_regularizer": null, "data_format": "channels_last", "activity_regularizer": null, "activation": "relu", "kernel_regularizer": null, "name": "block7_conv1", "strides": [1], "kernel_size": [7], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_constraint": null, "filters": 256, "kernel_constraint": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["pool6", 0, 0, {}]]]}, {"name": "batch_normalization_13", "class_name": "BatchNormalization", "config": {"momentum": 0.95, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "scale": true, "axis": -1, "gamma_constraint": null, "name": "batch_normalization_13", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "gamma_regularizer": null, "trainable": true, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}}, "inbound_nodes": [[["block7_conv1", 0, 0, {}]]]}, {"name": "dropout_7", "class_name": "Dropout", "config": {"name": "dropout_7", "trainable": true, "noise_shape": null, "seed": null, "rate": 0.5}, "inbound_nodes": [[["batch_normalization_13", 0, 0, {}]]]}, {"name": "block7_conv2", "class_name": "Conv1D", "config": {"trainable": true, "padding": "same", "dilation_rate": [1], "bias_regularizer": null, "data_format": "channels_last", "activity_regularizer": null, "activation": "relu", "kernel_regularizer": null, "name": "block7_conv2", "strides": [1], "kernel_size": [7], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_constraint": null, "filters": 256, "kernel_constraint": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["dropout_7", 0, 0, {}]]]}, {"name": "batch_normalization_14", "class_name": "BatchNormalization", "config": {"momentum": 0.95, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "scale": true, "axis": -1, "gamma_constraint": null, "name": "batch_normalization_14", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "gamma_regularizer": null, "trainable": true, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}}, "inbound_nodes": [[["block7_conv2", 0, 0, {}]]]}, {"name": "pool7", "class_name": "MaxPooling1D", "config": {"name": "pool7", "strides": [2], "pool_size": [3], "padding": "same", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["batch_normalization_14", 0, 0, {}]]]}, {"name": "block5notl_conv1", "class_name": "Conv1D", "config": {"trainable": true, "padding": "same", "dilation_rate": [1], "bias_regularizer": null, "data_format": "channels_last", "activity_regularizer": null, "activation": "relu", "kernel_regularizer": null, "name": "block5notl_conv1", "strides": [1], "kernel_size": [7], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_constraint": null, "filters": 512, "kernel_constraint": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["pool7", 0, 0, {}]]]}, {"name": "batch_normalization_15", "class_name": "BatchNormalization", "config": {"momentum": 0.95, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "scale": true, "axis": -1, "gamma_constraint": null, "name": "batch_normalization_15", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "gamma_regularizer": null, "trainable": true, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}}, "inbound_nodes": [[["block5notl_conv1", 0, 0, {}]]]}, {"name": "dropout_8", "class_name": "Dropout", "config": {"name": "dropout_8", "trainable": true, "noise_shape": null, "seed": null, "rate": 0.5}, "inbound_nodes": [[["batch_normalization_15", 0, 0, {}]]]}, {"name": "block5notl_conv2", "class_name": "Conv1D", "config": {"trainable": true, "padding": "same", "dilation_rate": [1], "bias_regularizer": null, "data_format": "channels_last", "activity_regularizer": null, "activation": "relu", "kernel_regularizer": null, "name": "block5notl_conv2", "strides": [1], "kernel_size": [7], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_constraint": null, "filters": 512, "kernel_constraint": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["dropout_8", 0, 0, {}]]]}, {"name": "batch_normalization_16", "class_name": "BatchNormalization", "config": {"momentum": 0.95, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "scale": true, "axis": -1, "gamma_constraint": null, "name": "batch_normalization_16", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "gamma_regularizer": null, "trainable": true, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}}, "inbound_nodes": [[["block5notl_conv2", 0, 0, {}]]]}, {"name": "up_sampling1d_1", "class_name": "UpSampling1D", "config": {"name": "up_sampling1d_1", "trainable": true, "size": 2}, "inbound_nodes": [[["batch_normalization_16", 0, 0, {}]]]}, {"name": "up7", "class_name": "Conv1D", "config": {"trainable": true, "padding": "same", "dilation_rate": [1], "bias_regularizer": null, "data_format": "channels_last", "activity_regularizer": null, "activation": "relu", "kernel_regularizer": null, "name": "up7", "strides": [1], "kernel_size": [1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_constraint": null, "filters": 256, "kernel_constraint": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["up_sampling1d_1", 0, 0, {}]]]}, {"name": "concatenate_1", "class_name": "Concatenate", "config": {"name": "concatenate_1", "trainable": true, "axis": -1}, "inbound_nodes": [[["up7", 0, 0, {}], ["batch_normalization_14", 0, 0, {}]]]}, {"name": "deconv7_conv1", "class_name": "Conv1D", "config": {"trainable": true, "padding": "same", "dilation_rate": [1], "bias_regularizer": null, "data_format": "channels_last", "activity_regularizer": null, "activation": "relu", "kernel_regularizer": null, "name": "deconv7_conv1", "strides": [1], "kernel_size": [7], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_constraint": null, "filters": 256, "kernel_constraint": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["concatenate_1", 0, 0, {}]]]}, {"name": "batch_normalization_17", "class_name": "BatchNormalization", "config": {"momentum": 0.95, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "scale": true, "axis": -1, "gamma_constraint": null, "name": "batch_normalization_17", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "gamma_regularizer": null, "trainable": true, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}}, "inbound_nodes": [[["deconv7_conv1", 0, 0, {}]]]}, {"name": "dropout_9", "class_name": "Dropout", "config": {"name": "dropout_9", "trainable": true, "noise_shape": null, "seed": null, "rate": 0.5}, "inbound_nodes": [[["batch_normalization_17", 0, 0, {}]]]}, {"name": "deconv7_conv2", "class_name": "Conv1D", "config": {"trainable": true, "padding": "same", "dilation_rate": [1], "bias_regularizer": null, "data_format": "channels_last", "activity_regularizer": null, "activation": "relu", "kernel_regularizer": null, "name": "deconv7_conv2", "strides": [1], "kernel_size": [7], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_constraint": null, "filters": 256, "kernel_constraint": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["dropout_9", 0, 0, {}]]]}, {"name": "batch_normalization_18", "class_name": "BatchNormalization", "config": {"momentum": 0.95, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "scale": true, "axis": -1, "gamma_constraint": null, "name": "batch_normalization_18", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "gamma_regularizer": null, "trainable": true, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}}, "inbound_nodes": [[["deconv7_conv2", 0, 0, {}]]]}, {"name": "up_sampling1d_2", "class_name": "UpSampling1D", "config": {"name": "up_sampling1d_2", "trainable": true, "size": 2}, "inbound_nodes": [[["batch_normalization_18", 0, 0, {}]]]}, {"name": "up6", "class_name": "Conv1D", "config": {"trainable": true, "padding": "same", "dilation_rate": [1], "bias_regularizer": null, "data_format": "channels_last", "activity_regularizer": null, "activation": "relu", "kernel_regularizer": null, "name": "up6", "strides": [1], "kernel_size": [1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_constraint": null, "filters": 128, "kernel_constraint": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["up_sampling1d_2", 0, 0, {}]]]}, {"name": "concatenate_2", "class_name": "Concatenate", "config": {"name": "concatenate_2", "trainable": true, "axis": -1}, "inbound_nodes": [[["up6", 0, 0, {}], ["batch_normalization_12", 0, 0, {}]]]}, {"name": "deconv6_conv1", "class_name": "Conv1D", "config": {"trainable": true, "padding": "same", "dilation_rate": [1], "bias_regularizer": null, "data_format": "channels_last", "activity_regularizer": null, "activation": "relu", "kernel_regularizer": null, "name": "deconv6_conv1", "strides": [1], "kernel_size": [7], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_constraint": null, "filters": 128, "kernel_constraint": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["concatenate_2", 0, 0, {}]]]}, {"name": "batch_normalization_19", "class_name": "BatchNormalization", "config": {"momentum": 0.95, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "scale": true, "axis": -1, "gamma_constraint": null, "name": "batch_normalization_19", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "gamma_regularizer": null, "trainable": true, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}}, "inbound_nodes": [[["deconv6_conv1", 0, 0, {}]]]}, {"name": "dropout_10", "class_name": "Dropout", "config": {"name": "dropout_10", "trainable": true, "noise_shape": null, "seed": null, "rate": 0.5}, "inbound_nodes": [[["batch_normalization_19", 0, 0, {}]]]}, {"name": "deconv6_conv2", "class_name": "Conv1D", "config": {"trainable": true, "padding": "same", "dilation_rate": [1], "bias_regularizer": null, "data_format": "channels_last", "activity_regularizer": null, "activation": "relu", "kernel_regularizer": null, "name": "deconv6_conv2", "strides": [1], "kernel_size": [7], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_constraint": null, "filters": 128, "kernel_constraint": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["dropout_10", 0, 0, {}]]]}, {"name": "batch_normalization_20", "class_name": "BatchNormalization", "config": {"momentum": 0.95, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "scale": true, "axis": -1, "gamma_constraint": null, "name": "batch_normalization_20", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "gamma_regularizer": null, "trainable": true, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}}, "inbound_nodes": [[["deconv6_conv2", 0, 0, {}]]]}, {"name": "up_sampling1d_3", "class_name": "UpSampling1D", "config": {"name": "up_sampling1d_3", "trainable": true, "size": 2}, "inbound_nodes": [[["batch_normalization_20", 0, 0, {}]]]}, {"name": "up5", "class_name": "Conv1D", "config": {"trainable": true, "padding": "same", "dilation_rate": [1], "bias_regularizer": null, "data_format": "channels_last", "activity_regularizer": null, "activation": "relu", "kernel_regularizer": null, "name": "up5", "strides": [1], "kernel_size": [1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_constraint": null, "filters": 128, "kernel_constraint": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["up_sampling1d_3", 0, 0, {}]]]}, {"name": "concatenate_3", "class_name": "Concatenate", "config": {"name": "concatenate_3", "trainable": true, "axis": -1}, "inbound_nodes": [[["up5", 0, 0, {}], ["batch_normalization_10", 0, 0, {}]]]}, {"name": "deconv5_conv1", "class_name": "Conv1D", "config": {"trainable": true, "padding": "same", "dilation_rate": [1], "bias_regularizer": null, "data_format": "channels_last", "activity_regularizer": null, "activation": "relu", "kernel_regularizer": null, "name": "deconv5_conv1", "strides": [1], "kernel_size": [7], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_constraint": null, "filters": 128, "kernel_constraint": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["concatenate_3", 0, 0, {}]]]}, {"name": "batch_normalization_21", "class_name": "BatchNormalization", "config": {"momentum": 0.95, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "scale": true, "axis": -1, "gamma_constraint": null, "name": "batch_normalization_21", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "gamma_regularizer": null, "trainable": true, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}}, "inbound_nodes": [[["deconv5_conv1", 0, 0, {}]]]}, {"name": "dropout_11", "class_name": "Dropout", "config": {"name": "dropout_11", "trainable": true, "noise_shape": null, "seed": null, "rate": 0.5}, "inbound_nodes": [[["batch_normalization_21", 0, 0, {}]]]}, {"name": "deconv5_conv2", "class_name": "Conv1D", "config": {"trainable": true, "padding": "same", "dilation_rate": [1], "bias_regularizer": null, "data_format": "channels_last", "activity_regularizer": null, "activation": "relu", "kernel_regularizer": null, "name": "deconv5_conv2", "strides": [1], "kernel_size": [7], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_constraint": null, "filters": 128, "kernel_constraint": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["dropout_11", 0, 0, {}]]]}, {"name": "batch_normalization_22", "class_name": "BatchNormalization", "config": {"momentum": 0.95, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "scale": true, "axis": -1, "gamma_constraint": null, "name": "batch_normalization_22", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "gamma_regularizer": null, "trainable": true, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}}, "inbound_nodes": [[["deconv5_conv2", 0, 0, {}]]]}, {"name": "up_sampling1d_4", "class_name": "UpSampling1D", "config": {"name": "up_sampling1d_4", "trainable": true, "size": 2}, "inbound_nodes": [[["batch_normalization_22", 0, 0, {}]]]}, {"name": "up4", "class_name": "Conv1D", "config": {"trainable": true, "padding": "same", "dilation_rate": [1], "bias_regularizer": null, "data_format": "channels_last", "activity_regularizer": null, "activation": "relu", "kernel_regularizer": null, "name": "up4", "strides": [1], "kernel_size": [1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_constraint": null, "filters": 64, "kernel_constraint": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["up_sampling1d_4", 0, 0, {}]]]}, {"name": "concatenate_4", "class_name": "Concatenate", "config": {"name": "concatenate_4", "trainable": true, "axis": -1}, "inbound_nodes": [[["up4", 0, 0, {}], ["batch_normalization_8", 0, 0, {}]]]}, {"name": "deconv4_conv1", "class_name": "Conv1D", "config": {"trainable": true, "padding": "same", "dilation_rate": [1], "bias_regularizer": null, "data_format": "channels_last", "activity_regularizer": null, "activation": "relu", "kernel_regularizer": null, "name": "deconv4_conv1", "strides": [1], "kernel_size": [7], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_constraint": null, "filters": 64, "kernel_constraint": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["concatenate_4", 0, 0, {}]]]}, {"name": "batch_normalization_23", "class_name": "BatchNormalization", "config": {"momentum": 0.95, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "scale": true, "axis": -1, "gamma_constraint": null, "name": "batch_normalization_23", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "gamma_regularizer": null, "trainable": true, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}}, "inbound_nodes": [[["deconv4_conv1", 0, 0, {}]]]}, {"name": "dropout_12", "class_name": "Dropout", "config": {"name": "dropout_12", "trainable": true, "noise_shape": null, "seed": null, "rate": 0.5}, "inbound_nodes": [[["batch_normalization_23", 0, 0, {}]]]}, {"name": "deconv4_conv2", "class_name": "Conv1D", "config": {"trainable": true, "padding": "same", "dilation_rate": [1], "bias_regularizer": null, "data_format": "channels_last", "activity_regularizer": null, "activation": "relu", "kernel_regularizer": null, "name": "deconv4_conv2", "strides": [1], "kernel_size": [7], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_constraint": null, "filters": 64, "kernel_constraint": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["dropout_12", 0, 0, {}]]]}, {"name": "batch_normalization_24", "class_name": "BatchNormalization", "config": {"momentum": 0.95, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "scale": true, "axis": -1, "gamma_constraint": null, "name": "batch_normalization_24", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "gamma_regularizer": null, "trainable": true, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}}, "inbound_nodes": [[["deconv4_conv2", 0, 0, {}]]]}, {"name": "up_sampling1d_5", "class_name": "UpSampling1D", "config": {"name": "up_sampling1d_5", "trainable": true, "size": 2}, "inbound_nodes": [[["batch_normalization_24", 0, 0, {}]]]}, {"name": "up3", "class_name": "Conv1D", "config": {"trainable": true, "padding": "same", "dilation_rate": [1], "bias_regularizer": null, "data_format": "channels_last", "activity_regularizer": null, "activation": "relu", "kernel_regularizer": null, "name": "up3", "strides": [1], "kernel_size": [1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_constraint": null, "filters": 64, "kernel_constraint": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["up_sampling1d_5", 0, 0, {}]]]}, {"name": "concatenate_5", "class_name": "Concatenate", "config": {"name": "concatenate_5", "trainable": true, "axis": -1}, "inbound_nodes": [[["up3", 0, 0, {}], ["batch_normalization_6", 0, 0, {}]]]}, {"name": "deconv3_conv1", "class_name": "Conv1D", "config": {"trainable": true, "padding": "same", "dilation_rate": [1], "bias_regularizer": null, "data_format": "channels_last", "activity_regularizer": null, "activation": "relu", "kernel_regularizer": null, "name": "deconv3_conv1", "strides": [1], "kernel_size": [7], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_constraint": null, "filters": 64, "kernel_constraint": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["concatenate_5", 0, 0, {}]]]}, {"name": "batch_normalization_25", "class_name": "BatchNormalization", "config": {"momentum": 0.95, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "scale": true, "axis": -1, "gamma_constraint": null, "name": "batch_normalization_25", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "gamma_regularizer": null, "trainable": true, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}}, "inbound_nodes": [[["deconv3_conv1", 0, 0, {}]]]}, {"name": "dropout_13", "class_name": "Dropout", "config": {"name": "dropout_13", "trainable": true, "noise_shape": null, "seed": null, "rate": 0.5}, "inbound_nodes": [[["batch_normalization_25", 0, 0, {}]]]}, {"name": "deconv3_conv2", "class_name": "Conv1D", "config": {"trainable": true, "padding": "same", "dilation_rate": [1], "bias_regularizer": null, "data_format": "channels_last", "activity_regularizer": null, "activation": "relu", "kernel_regularizer": null, "name": "deconv3_conv2", "strides": [1], "kernel_size": [7], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_constraint": null, "filters": 64, "kernel_constraint": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["dropout_13", 0, 0, {}]]]}, {"name": "batch_normalization_26", "class_name": "BatchNormalization", "config": {"momentum": 0.95, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "scale": true, "axis": -1, "gamma_constraint": null, "name": "batch_normalization_26", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "gamma_regularizer": null, "trainable": true, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}}, "inbound_nodes": [[["deconv3_conv2", 0, 0, {}]]]}, {"name": "up_sampling1d_6", "class_name": "UpSampling1D", "config": {"name": "up_sampling1d_6", "trainable": true, "size": 2}, "inbound_nodes": [[["batch_normalization_26", 0, 0, {}]]]}, {"name": "up2", "class_name": "Conv1D", "config": {"trainable": true, "padding": "same", "dilation_rate": [1], "bias_regularizer": null, "data_format": "channels_last", "activity_regularizer": null, "activation": "relu", "kernel_regularizer": null, "name": "up2", "strides": [1], "kernel_size": [1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_constraint": null, "filters": 32, "kernel_constraint": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["up_sampling1d_6", 0, 0, {}]]]}, {"name": "concatenate_6", "class_name": "Concatenate", "config": {"name": "concatenate_6", "trainable": true, "axis": -1}, "inbound_nodes": [[["up2", 0, 0, {}], ["batch_normalization_4", 0, 0, {}]]]}, {"name": "deconv2_conv1", "class_name": "Conv1D", "config": {"trainable": true, "padding": "same", "dilation_rate": [1], "bias_regularizer": null, "data_format": "channels_last", "activity_regularizer": null, "activation": "relu", "kernel_regularizer": null, "name": "deconv2_conv1", "strides": [1], "kernel_size": [7], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_constraint": null, "filters": 32, "kernel_constraint": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["concatenate_6", 0, 0, {}]]]}, {"name": "batch_normalization_27", "class_name": "BatchNormalization", "config": {"momentum": 0.95, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "scale": true, "axis": -1, "gamma_constraint": null, "name": "batch_normalization_27", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "gamma_regularizer": null, "trainable": true, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}}, "inbound_nodes": [[["deconv2_conv1", 0, 0, {}]]]}, {"name": "dropout_14", "class_name": "Dropout", "config": {"name": "dropout_14", "trainable": true, "noise_shape": null, "seed": null, "rate": 0.5}, "inbound_nodes": [[["batch_normalization_27", 0, 0, {}]]]}, {"name": "deconv2_conv2", "class_name": "Conv1D", "config": {"trainable": true, "padding": "same", "dilation_rate": [1], "bias_regularizer": null, "data_format": "channels_last", "activity_regularizer": null, "activation": "relu", "kernel_regularizer": null, "name": "deconv2_conv2", "strides": [1], "kernel_size": [7], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_constraint": null, "filters": 32, "kernel_constraint": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["dropout_14", 0, 0, {}]]]}, {"name": "batch_normalization_28", "class_name": "BatchNormalization", "config": {"momentum": 0.95, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "scale": true, "axis": -1, "gamma_constraint": null, "name": "batch_normalization_28", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "gamma_regularizer": null, "trainable": true, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}}, "inbound_nodes": [[["deconv2_conv2", 0, 0, {}]]]}, {"name": "up_sampling1d_7", "class_name": "UpSampling1D", "config": {"name": "up_sampling1d_7", "trainable": true, "size": 2}, "inbound_nodes": [[["batch_normalization_28", 0, 0, {}]]]}, {"name": "up1", "class_name": "Conv1D", "config": {"trainable": true, "padding": "same", "dilation_rate": [1], "bias_regularizer": null, "data_format": "channels_last", "activity_regularizer": null, "activation": "relu", "kernel_regularizer": null, "name": "up1", "strides": [1], "kernel_size": [1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_constraint": null, "filters": 32, "kernel_constraint": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["up_sampling1d_7", 0, 0, {}]]]}, {"name": "concatenate_7", "class_name": "Concatenate", "config": {"name": "concatenate_7", "trainable": true, "axis": -1}, "inbound_nodes": [[["up1", 0, 0, {}], ["batch_normalization_2", 0, 0, {}]]]}, {"name": "deconv1_conv1", "class_name": "Conv1D", "config": {"trainable": true, "padding": "same", "dilation_rate": [1], "bias_regularizer": null, "data_format": "channels_last", "activity_regularizer": null, "activation": "relu", "kernel_regularizer": null, "name": "deconv1_conv1", "strides": [1], "kernel_size": [7], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_constraint": null, "filters": 32, "kernel_constraint": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["concatenate_7", 0, 0, {}]]]}, {"name": "batch_normalization_29", "class_name": "BatchNormalization", "config": {"momentum": 0.95, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "scale": true, "axis": -1, "gamma_constraint": null, "name": "batch_normalization_29", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "gamma_regularizer": null, "trainable": true, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}}, "inbound_nodes": [[["deconv1_conv1", 0, 0, {}]]]}, {"name": "dropout_15", "class_name": "Dropout", "config": {"name": "dropout_15", "trainable": true, "noise_shape": null, "seed": null, "rate": 0.5}, "inbound_nodes": [[["batch_normalization_29", 0, 0, {}]]]}, {"name": "deconv1_conv2", "class_name": "Conv1D", "config": {"trainable": true, "padding": "same", "dilation_rate": [1], "bias_regularizer": null, "data_format": "channels_last", "activity_regularizer": null, "activation": "relu", "kernel_regularizer": null, "name": "deconv1_conv2", "strides": [1], "kernel_size": [7], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_constraint": null, "filters": 32, "kernel_constraint": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["dropout_15", 0, 0, {}]]]}, {"name": 